RunningStyle = 0  # 0/1/2/3: 逃/先/差/追

AttributePriority = [0,1,2,4,3] # 0/1/2/3/4: SPD/STA/POW/WIL/WIS
                                # Speed/Stamina/Power/Willness/Wisdom

ObjectiveAttributeMin = [
  #SPD,STA,POW,WIL,WIS
  [100,100,100, 90, 90],
  [200,200,200,100,100],  # 朝日杯
  [250,250,200,100,100],  # スプリングステークス
  [250,250,200,100,100],  # 皐月賞
  [250,250,200,100,100],  # 日本ダービー
  [300,350,200,150,200],  # 菊花賞
  [400,500,300,200,300],  # 天皇賞(春)
  [500,500,400,200,300],  # ジャパC
  [600,500,400,250,400],  # 有馬紀念
]

ObjectiveAttributeOK = [
  [200,200,200,100,100],
  [300,200,300,100,150],  # 朝日杯
  [350,300,350,200,200],  # スプリングステークス
  [350,300,400,200,250],  # 皐月賞
  [350,350,400,200,250],  # 日本ダービー
  [450,450,400,250,300],  # 菊花賞
  [450,600,400,300,350],  # 天皇賞(春)
  [600,600,500,300,400],  # ジャパC
  [600,600,600,300,400],  # 有馬紀念
]

OptionalRace = [
  ''
]